grevaillot/svd_tools/headers/ATSAM4SA16B/pmc.h
/** @defgroup pmc_pmc_pcdr0 PMCPCDR0 Peripheral Clock Disable Register 0
@{*/

/** PMC_PMC_PCDR0_PID31 Peripheral Clock 31 Disable **/
#define PMC_PMC_PCDR0_PID31		(1 << 31)
/** PMC_PMC_PCDR0_PID30 Peripheral Clock 30 Disable **/
#define PMC_PMC_PCDR0_PID30		(1 << 30)
/** PMC_PMC_PCDR0_PID29 Peripheral Clock 29 Disable **/
#define PMC_PMC_PCDR0_PID29		(1 << 29)
/** PMC_PMC_PCDR0_PID28 Peripheral Clock 28 Disable **/
#define PMC_PMC_PCDR0_PID28		(1 << 28)
/** PMC_PMC_PCDR0_PID27 Peripheral Clock 27 Disable **/
#define PMC_PMC_PCDR0_PID27		(1 << 27)
/** PMC_PMC_PCDR0_PID26 Peripheral Clock 26 Disable **/
#define PMC_PMC_PCDR0_PID26		(1 << 26)
/** PMC_PMC_PCDR0_PID25 Peripheral Clock 25 Disable **/
#define PMC_PMC_PCDR0_PID25		(1 << 25)
/** PMC_PMC_PCDR0_PID24 Peripheral Clock 24 Disable **/
#define PMC_PMC_PCDR0_PID24		(1 << 24)
/** PMC_PMC_PCDR0_PID23 Peripheral Clock 23 Disable **/
#define PMC_PMC_PCDR0_PID23		(1 << 23)
/** PMC_PMC_PCDR0_PID22 Peripheral Clock 22 Disable **/
#define PMC_PMC_PCDR0_PID22		(1 << 22)
/** PMC_PMC_PCDR0_PID21 Peripheral Clock 21 Disable **/
#define PMC_PMC_PCDR0_PID21		(1 << 21)
/** PMC_PMC_PCDR0_PID20 Peripheral Clock 20 Disable **/
#define PMC_PMC_PCDR0_PID20		(1 << 20)
/** PMC_PMC_PCDR0_PID19 Peripheral Clock 19 Disable **/
#define PMC_PMC_PCDR0_PID19		(1 << 19)
/** PMC_PMC_PCDR0_PID18 Peripheral Clock 18 Disable **/
#define PMC_PMC_PCDR0_PID18		(1 << 18)
/** PMC_PMC_PCDR0_PID17 Peripheral Clock 17 Disable **/
#define PMC_PMC_PCDR0_PID17		(1 << 17)
/** PMC_PMC_PCDR0_PID16 Peripheral Clock 16 Disable **/
#define PMC_PMC_PCDR0_PID16		(1 << 16)
/** PMC_PMC_PCDR0_PID15 Peripheral Clock 15 Disable **/
#define PMC_PMC_PCDR0_PID15		(1 << 15)
/** PMC_PMC_PCDR0_PID14 Peripheral Clock 14 Disable **/
#define PMC_PMC_PCDR0_PID14		(1 << 14)
/** PMC_PMC_PCDR0_PID13 Peripheral Clock 13 Disable **/
#define PMC_PMC_PCDR0_PID13		(1 << 13)
/** PMC_PMC_PCDR0_PID12 Peripheral Clock 12 Disable **/
#define PMC_PMC_PCDR0_PID12		(1 << 12)
/** PMC_PMC_PCDR0_PID11 Peripheral Clock 11 Disable **/
#define PMC_PMC_PCDR0_PID11		(1 << 11)
/** PMC_PMC_PCDR0_PID10 Peripheral Clock 10 Disable **/
#define PMC_PMC_PCDR0_PID10		(1 << 10)
/** PMC_PMC_PCDR0_PID9 Peripheral Clock 9 Disable **/
#define PMC_PMC_PCDR0_PID9		(1 << 9)
/** PMC_PMC_PCDR0_PID8 Peripheral Clock 8 Disable **/
#define PMC_PMC_PCDR0_PID8		(1 << 8)

/**@}*/

/** @defgroup pmc_pmc_pcsr0 PMCPCSR0 Peripheral Clock Status Register 0
@{*/

/** PMC_PMC_PCSR0_PID31 Peripheral Clock 31 Status **/
#define PMC_PMC_PCSR0_PID31		(1 << 31)
/** PMC_PMC_PCSR0_PID30 Peripheral Clock 30 Status **/
#define PMC_PMC_PCSR0_PID30		(1 << 30)
/** PMC_PMC_PCSR0_PID29 Peripheral Clock 29 Status **/
#define PMC_PMC_PCSR0_PID29		(1 << 29)
/** PMC_PMC_PCSR0_PID28 Peripheral Clock 28 Status **/
#define PMC_PMC_PCSR0_PID28		(1 << 28)
/** PMC_PMC_PCSR0_PID27 Peripheral Clock 27 Status **/
#define PMC_PMC_PCSR0_PID27		(1 << 27)
/** PMC_PMC_PCSR0_PID26 Peripheral Clock 26 Status **/
#define PMC_PMC_PCSR0_PID26		(1 << 26)
/** PMC_PMC_PCSR0_PID25 Peripheral Clock 25 Status **/
#define PMC_PMC_PCSR0_PID25		(1 << 25)
/** PMC_PMC_PCSR0_PID24 Peripheral Clock 24 Status **/
#define PMC_PMC_PCSR0_PID24		(1 << 24)
/** PMC_PMC_PCSR0_PID23 Peripheral Clock 23 Status **/
#define PMC_PMC_PCSR0_PID23		(1 << 23)
/** PMC_PMC_PCSR0_PID22 Peripheral Clock 22 Status **/
#define PMC_PMC_PCSR0_PID22		(1 << 22)
/** PMC_PMC_PCSR0_PID21 Peripheral Clock 21 Status **/
#define PMC_PMC_PCSR0_PID21		(1 << 21)
/** PMC_PMC_PCSR0_PID20 Peripheral Clock 20 Status **/
#define PMC_PMC_PCSR0_PID20		(1 << 20)
/** PMC_PMC_PCSR0_PID19 Peripheral Clock 19 Status **/
#define PMC_PMC_PCSR0_PID19		(1 << 19)
/** PMC_PMC_PCSR0_PID18 Peripheral Clock 18 Status **/
#define PMC_PMC_PCSR0_PID18		(1 << 18)
/** PMC_PMC_PCSR0_PID17 Peripheral Clock 17 Status **/
#define PMC_PMC_PCSR0_PID17		(1 << 17)
/** PMC_PMC_PCSR0_PID16 Peripheral Clock 16 Status **/
#define PMC_PMC_PCSR0_PID16		(1 << 16)
/** PMC_PMC_PCSR0_PID15 Peripheral Clock 15 Status **/
#define PMC_PMC_PCSR0_PID15		(1 << 15)
/** PMC_PMC_PCSR0_PID14 Peripheral Clock 14 Status **/
#define PMC_PMC_PCSR0_PID14		(1 << 14)
/** PMC_PMC_PCSR0_PID13 Peripheral Clock 13 Status **/
#define PMC_PMC_PCSR0_PID13		(1 << 13)
/** PMC_PMC_PCSR0_PID12 Peripheral Clock 12 Status **/
#define PMC_PMC_PCSR0_PID12		(1 << 12)
/** PMC_PMC_PCSR0_PID11 Peripheral Clock 11 Status **/
#define PMC_PMC_PCSR0_PID11		(1 << 11)
/** PMC_PMC_PCSR0_PID10 Peripheral Clock 10 Status **/
#define PMC_PMC_PCSR0_PID10		(1 << 10)
/** PMC_PMC_PCSR0_PID9 Peripheral Clock 9 Status **/
#define PMC_PMC_PCSR0_PID9		(1 << 9)
/** PMC_PMC_PCSR0_PID8 Peripheral Clock 8 Status **/
#define PMC_PMC_PCSR0_PID8		(1 << 8)

/**@}*/

/** @defgroup pmc_ckgr_mor CKGRMOR Main Oscillator Register
@{*/

/** PMC_CKGR_MOR_CFDEN Clock Failure Detector Enable **/
#define PMC_CKGR_MOR_CFDEN		(1 << 25)
/** PMC_CKGR_MOR_MOSCSEL Main Oscillator Selection **/
#define PMC_CKGR_MOR_MOSCSEL		(1 << 24)

#define PMC_CKGR_MOR_KEY_SHIFT		16
#define PMC_CKGR_MOR_KEY_MASK		0xff
/** @defgroup pmc_ckgr_mor_key KEY Write Access Password
@{*/
/**@}*/


#define PMC_CKGR_MOR_MOSCXTST_SHIFT		8
#define PMC_CKGR_MOR_MOSCXTST_MASK		0xff
/** @defgroup pmc_ckgr_mor_moscxtst MOSCXTST Main Crystal Oscillator Start-up Time
@{*/
/**@}*/


#define PMC_CKGR_MOR_MOSCRCF_SHIFT		4
#define PMC_CKGR_MOR_MOSCRCF_MASK		0x07
/** @defgroup pmc_ckgr_mor_moscrcf MOSCRCF Main On-Chip RC Oscillator Frequency Selection
@{*/
/**@}*/

/** PMC_CKGR_MOR_MOSCRCEN Main On-Chip RC Oscillator Enable **/
#define PMC_CKGR_MOR_MOSCRCEN		(1 << 3)
/** PMC_CKGR_MOR_WAITMODE Wait Mode Command (Write-only) **/
#define PMC_CKGR_MOR_WAITMODE		(1 << 2)
/** PMC_CKGR_MOR_MOSCXTBY Main Crystal Oscillator Bypass **/
#define PMC_CKGR_MOR_MOSCXTBY		(1 << 1)
/** PMC_CKGR_MOR_MOSCXTEN Main Crystal Oscillator Enable **/
#define PMC_CKGR_MOR_MOSCXTEN		(1 << 0)

/**@}*/

/** @defgroup pmc_ckgr_mcfr CKGRMCFR Main Clock Frequency Register
@{*/

/** PMC_CKGR_MCFR_RCMEAS RC Oscillator Frequency Measure (write-only) **/
#define PMC_CKGR_MCFR_RCMEAS		(1 << 20)
/** PMC_CKGR_MCFR_MAINFRDY Main Clock Frequency Measure Ready **/
#define PMC_CKGR_MCFR_MAINFRDY		(1 << 16)

#define PMC_CKGR_MCFR_MAINF_SHIFT		0
#define PMC_CKGR_MCFR_MAINF_MASK		0xffff
/** @defgroup pmc_ckgr_mcfr_mainf MAINF Main Clock Frequency
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_ckgr_pllar CKGRPLLAR PLLA Register
@{*/

/** PMC_CKGR_PLLAR_ONE Must Be Set to 1 **/
#define PMC_CKGR_PLLAR_ONE		(1 << 29)

#define PMC_CKGR_PLLAR_MULA_SHIFT		16
#define PMC_CKGR_PLLAR_MULA_MASK		0x7ff
/** @defgroup pmc_ckgr_pllar_mula MULA PLLA Multiplier
@{*/
/**@}*/


#define PMC_CKGR_PLLAR_PLLACOUNT_SHIFT		8
#define PMC_CKGR_PLLAR_PLLACOUNT_MASK		0x3f
/** @defgroup pmc_ckgr_pllar_pllacount PLLACOUNT PLLA Counter
@{*/
/**@}*/


#define PMC_CKGR_PLLAR_DIVA_SHIFT		0
#define PMC_CKGR_PLLAR_DIVA_MASK		0xff
/** @defgroup pmc_ckgr_pllar_diva DIVA PLLA Front_End Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_ckgr_pllbr CKGRPLLBR PLLB Register
@{*/


#define PMC_CKGR_PLLBR_MULB_SHIFT		16
#define PMC_CKGR_PLLBR_MULB_MASK		0x7ff
/** @defgroup pmc_ckgr_pllbr_mulb MULB PLLB Multiplier
@{*/
/**@}*/


#define PMC_CKGR_PLLBR_PLLBCOUNT_SHIFT		8
#define PMC_CKGR_PLLBR_PLLBCOUNT_MASK		0x3f
/** @defgroup pmc_ckgr_pllbr_pllbcount PLLBCOUNT PLLB Counter
@{*/
/**@}*/


#define PMC_CKGR_PLLBR_DIVB_SHIFT		0
#define PMC_CKGR_PLLBR_DIVB_MASK		0xff
/** @defgroup pmc_ckgr_pllbr_divb DIVB PLLB Front-End Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_mckr PMCMCKR Master Clock Register
@{*/

