grevaillot/svd_tools/headers/ATSAM4SA16B/pmc.h
/** @defgroup pmc_pmc_focr PMCFOCR Fault Output Clear Register
@{*/

/** PMC_PMC_FOCR_FOCLR Fault Output Clear **/
#define PMC_PMC_FOCR_FOCLR		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_wpmr PMCWPMR Write Protection Mode Register
@{*/


#define PMC_PMC_WPMR_WPKEY_SHIFT		8
#define PMC_PMC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup pmc_pmc_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** PMC_PMC_WPMR_WPEN Write Protection Enable **/
#define PMC_PMC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_wpsr PMCWPSR Write Protection Status Register
@{*/


#define PMC_PMC_WPSR_WPVSRC_SHIFT		8
#define PMC_PMC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pmc_pmc_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** PMC_PMC_WPSR_WPVS Write Protection Violation Status **/
#define PMC_PMC_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcer1 PMCPCER1 Peripheral Clock Enable Register 1
@{*/

/** PMC_PMC_PCER1_PID34 Peripheral Clock 34 Enable **/
#define PMC_PMC_PCER1_PID34		(1 << 2)
/** PMC_PMC_PCER1_PID33 Peripheral Clock 33 Enable **/
#define PMC_PMC_PCER1_PID33		(1 << 1)
/** PMC_PMC_PCER1_PID32 Peripheral Clock 32 Enable **/
#define PMC_PMC_PCER1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcdr1 PMCPCDR1 Peripheral Clock Disable Register 1
@{*/

/** PMC_PMC_PCDR1_PID34 Peripheral Clock 34 Disable **/
#define PMC_PMC_PCDR1_PID34		(1 << 2)
/** PMC_PMC_PCDR1_PID33 Peripheral Clock 33 Disable **/
#define PMC_PMC_PCDR1_PID33		(1 << 1)
/** PMC_PMC_PCDR1_PID32 Peripheral Clock 32 Disable **/
#define PMC_PMC_PCDR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcsr1 PMCPCSR1 Peripheral Clock Status Register 1
@{*/

/** PMC_PMC_PCSR1_PID34 Peripheral Clock 34 Status **/
#define PMC_PMC_PCSR1_PID34		(1 << 2)
/** PMC_PMC_PCSR1_PID33 Peripheral Clock 33 Status **/
#define PMC_PMC_PCSR1_PID33		(1 << 1)
/** PMC_PMC_PCSR1_PID32 Peripheral Clock 32 Status **/
#define PMC_PMC_PCSR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_ocr PMCOCR Oscillator Calibration Register
@{*/

/** PMC_PMC_OCR_SEL12 Selection of RC Oscillator Calibration bits for 12 MHz **/
#define PMC_PMC_OCR_SEL12		(1 << 23)

#define PMC_PMC_OCR_CAL12_SHIFT		16
#define PMC_PMC_OCR_CAL12_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal12 CAL12 RC Oscillator Calibration bits for 12 MHz
@{*/
/**@}*/

/** PMC_PMC_OCR_SEL8 Selection of RC Oscillator Calibration bits for 8 MHz **/
#define PMC_PMC_OCR_SEL8		(1 << 15)

#define PMC_PMC_OCR_CAL8_SHIFT		8
#define PMC_PMC_OCR_CAL8_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal8 CAL8 RC Oscillator Calibration bits for 8 MHz
@{*/
/**@}*/

/** PMC_PMC_OCR_SEL4 Selection of RC Oscillator Calibration bits for 4 MHz **/
#define PMC_PMC_OCR_SEL4		(1 << 7)

#define PMC_PMC_OCR_CAL4_SHIFT		0
#define PMC_PMC_OCR_CAL4_MASK		0x7f
/** @defgroup pmc_pmc_ocr_cal4 CAL4 RC Oscillator Calibration bits for 4 MHz
@{*/
/**@}*/


/**@}*/
